//Учитывая две строки needle и haystack, верните индекс первого вхождения из needle в haystack,
// или -1 если needle не является частью haystack.
//
//Пример 1:
//x
//Входные данные: haystack = "sadbutsad", needle = "sad"
//Выходные данные: 0
//Объяснение: "sad" встречается с индексами 0 и 6.
//Первое вхождение имеет индекс 0, поэтому мы возвращаем 0.
//Пример 2:
//
//Входные данные: haystack = "leetcode", needle = "leeto"
//Выходные данные: -1
//Объяснение: "leeto" не встречается в "leetcode", поэтому мы возвращаем -1.




public class task_9_24_05 {
    public static void main(String[] args) {
        System.out.println(strStr ("liolut", "lu"));
    }
    public static int strStr(String haystack, String needle) {
        return haystack.indexOf(needle);


    }
}




